soaptest

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://bancoripley.com.pe/srv/RECustomerReferenceData/v1.0/" xmlns:v4="http://bancoripley.com.pe/srv/generic/messageFormat/v4.0/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-3543ED6FA02415371D15464502829641">
            <wsse:Username>APM_U100D</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Bancoripley@2018</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">z6jrUssvC4ajqjqHwrNdjg==</wsse:Nonce>
            <wsu:Created>2019-01-02T17:31:22.961Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <v4:HeaderRequest>
         <request>
            <serviceId>SAT</serviceId>
            <consumerId>PU</consumerId>
            <moduleId>MODPAGOS</moduleId>
            <channelCode>08</channelCode>
            <messageId>2018050715290459205</messageId>
            <timestamp>2018-05-07T15:29:04.592-05:00</timestamp>
            <countryCode>PE</countryCode>
            <groupMember>G0013</groupMember>
            <referenceNumber>REFNM0001</referenceNumber>
         </request>
         <identity>
            <netId>PU</netId>
            <userId>BPIB0003</userId>
            <supervisorId>BPIB0003</supervisorId>
            <deviceId>13.10.13.1</deviceId>
            <serverId>BSE</serverId>
            <branchCode>898</branchCode>
         </identity>
      </v4:HeaderRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v1:RetrieveCustomerReferenceData>
         <cr-reference-id>468</cr-reference-id>
         <bq-reference-id>468</bq-reference-id>
      </v1:RetrieveCustomerReferenceData>
   </soapenv:Body>
</soapenv:Envelope>
